doc/defstar.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>DEFSTAR</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-03-19 16:13:59 "/>
<meta name="author" content="Paul Sexton"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">DEFSTAR</h1>

<p><a name="defstar" id="defstar"></a>
<a name="package==defstar" id="package==defstar"></a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Internal Package: <code>defstar</code></a>
<ul>
<li><a href="#sec-1.1">1.1 Description</a></li>
<li><a href="#sec-1.2">1.2 Type DECLARATION versus type CHECKING</a></li>
<li><a href="#sec-1.3">1.3 Examples of DEFUN* and DEFMETHOD* usage</a></li>
<li><a href="#sec-1.4">1.4 Examples of DEFVAR* and DEFPARAMETER* usage</a></li>
<li><a href="#sec-1.5">1.5 Limitations</a></li>
<li><a href="#sec-1.6">1.6 Syntax highlighting of DEFSTAR macros in Emacs</a></li>
<li><a href="#sec-1.7">1.7 External Symbols</a>
<ul>
<li><a href="#sec-1.7.1">1.7.1 External Global Variables</a>
<ul>
<li><a href="#sec-1.7.1.1">1.7.1.1 External Variable: <code>*check-argument-types-explicitly?*</code></a></li>
</ul>
</li>
<li><a href="#sec-1.7.2">1.7.2 External Macros</a>
<ul>
<li><a href="#sec-1.7.2.1">1.7.2.1 External Macro: <code>*let</code></a></li>
<li><a href="#sec-1.7.2.2">1.7.2.2 External Macro: <code>defgeneric*</code></a></li>
<li><a href="#sec-1.7.2.3">1.7.2.3 External Macro: <code>defmethod*</code></a></li>
<li><a href="#sec-1.7.2.4">1.7.2.4 External Macro: <code>defparameter*</code></a></li>
<li><a href="#sec-1.7.2.5">1.7.2.5 External Macro: <code>defun*</code></a></li>
<li><a href="#sec-1.7.2.6">1.7.2.6 External Macro: <code>defvar*</code></a></li>
<li><a href="#sec-1.7.2.7">1.7.2.7 External Macro: <code>flet*</code></a></li>
<li><a href="#sec-1.7.2.8">1.7.2.8 External Macro: <code>labels*</code></a></li>
<li><a href="#sec-1.7.2.9">1.7.2.9 External Macro: <code>lambda*</code></a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1.8">1.8 Index</a>
<ul>
<li><a href="#sec-1.8.1">1.8.1 Nonalphabetic</a></li>
<li><a href="#sec-1.8.2">1.8.2 D</a></li>
<li><a href="#sec-1.8.3">1.8.3 F</a></li>
<li><a href="#sec-1.8.4">1.8.4 L</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Colophon</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Internal Package: <code>defstar</code></h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>
Uses:
<a href="#package==common-lisp">common-lisp</a>

</li>
</ul>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1.1">



<p>
DEFSTAR is a collection of macros that can be used in place of <code>DEFUN, DEFMETHOD, DEFGENERIC, DEFVAR, DEFPARAMETER, FLET, LABELS</code> and <code>LAMBDA</code>. Each
macro has the same name as the form it replaces, with a star added at the end,
e.g. <code>DEFUN*</code>.
</p>
<p>
The macros allow:
</p><ul>
<li>
easy inclusion of type declarations within lambda lists
</li>
<li>
easy inclusion of return type declarations in function and method definitions
</li>
<li>
easy inclusion of assertions for each argument and for the function's
return value

</li>
</ul>

<p>See <a href="#defun*">defun*</a> and <a href="#defvar*">defvar*</a> for a detailed description of syntax. See also
the examples below.
</p>
<p>
DEFSTAR's home is at:
</p><ul>
<li>
<a href="http://bitbucket.org/eeeickythump/defstar/">http://bitbucket.org/eeeickythump/defstar/</a>

</li>
</ul>

<p>Installation requires <a href="http://common-lisp.net/project/asdf/">ASDF</a>. DEFSTAR
does not depend on any other libraries.
</p>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Type DECLARATION versus type CHECKING</h3>
<div class="outline-text-3" id="text-1.2">



<p>
Technically, <code>DECLARE</code>, <code>DECLAIM</code> and the like do not actually check that
values stored in the associated variables conform to the declared type.
They merely constitute a promise <i>by the programmer</i> that only values of
the specified type will be stored there. The consequences of storing
a string in a variable that is declared to be of type integer, are
technically 'undefined'.
</p>
<p>
In practice, most modern Common Lisp implementations perform type-checking
based on declaration information, especially when the <code>SAFETY</code> setting is high.
</p>
<p>
DEFSTAR allows you to force lisp to perform type checking based on
declarations. If you set the global variable
<a href="#*check-argument-types-explicitly..3f..*"><b>check-argument-types-explicitly?</b></a> to non-nil, <code>CHECK-TYPE</code> forms will
included in the body of each function or method, causing an error to be raised
if a value does not match its declared type.
</p>
</div>

</div>
