doc/defstar.org
** Examples of DEFUN* and DEFMETHOD* usage

#+BEGIN_SRC lisp
 ;; Define a simple function that adds two numbers, both of which
 ;; are declared to be real.
 (defun* sum ((a real) (b real))
    (+ a b))

 ;; Now also declare that the function returns a real.
 (defun* (sum -> real) ((a real) (b real))
    (+ a b))

 ;; Another way of declaring the function's return type.
 (defun* sum ((a real) (b real))
    (returns real)
    (+ a b))

 ;; We want to ensure that a and b are never negative.
 ;; One way is to alter the type declarations:
 (defun* (sum -> (real 0)) ((a (real 0)) (b (real 0)))
    (+ a b))

 ;; Another way is to define a new type:
 (deftype natural () '(real 0))
 (defun* (sum -> natural) ((a natural) (b natural))
    (+ a b))

 ;; Another way is to use assertions:
 (defun* (sum -> real (>= return-value 0)) ((a real (>= a 0)) (b real (>= b 0)))
    (+ a b))

 ;; Or:
 (defun* sum ((a real (>= a 0)) (b real (>= b 0)))
    (returns real (>= return-value 0))
    (+ a b))

 ;; Or, using the feature that the names of single-argument predicate
 ;; functions can be used as assertions:
 (defun* (naturalp -> boolean) ((x real))
    (not (minusp x)))
 ...
 (defun* (sum -> real naturalp) ((a real naturalp) (b real naturalp))
    (+ a b))

 ;; A function that returns multiple values.
 (defun* (floor -> (values integer integer)) ((n real) (d real))
    (cl:floor n d))

 ;; It is possible to use assertions with functions that return
 ;; multiple values. When a function is declared to return multiple
 ;; values, RETURN-VALUE will be bound to a LIST of those values.
 (defun* floor ((n real) (d real))
    (returns (values integer integer)
             (< (second return-value) (first return-value)))
    (cl:floor n d))

 ;; To declare that a function returns an unspecified number of
 ;; values, of unspecified types:
 (defun* (floor -> (values)) ((n real) (d real))
    ...)

 ;; The type of a &REST argument can be declared. The declaration
 ;; refers to the types of each element in the list of arguments
 ;; stored in the &REST argument.
 (defun* (+ -> real) (&rest (numbers real))
    (apply #'cl:+ numbers))

 ;; More complicated lambda list.
 ;; Note that the function and its first argument do not have type
 ;; declarations.
 ;; Also note the syntax of typed keyword arguments:
 ;; ((var TYPE [ASSERTION]) DEFAULT [SUPPLIEDP])
 ;; Note that &OPTIONAL arguments use the same syntax.
 (defun* my-find (item (seq sequence) &key (from-end boolean)
                  ((test (or null (function (t)))) nil)
                  ((test-not (or null (function (t)))) nil)
                  ((key (or null (function (t)))) nil)
                  (start fixnum) (end fixnum))
    ...function body...)

 ;; Example of method definition. All the arguments in the arglist are
 ;; normal 'specialised' arguments like you would usually find in a
 ;; method definition. The form still allows you to include an assertion
 ;; with each argument, however ('plusp' in this case).
 (defmethod* (cell-value -> real) :around ((sheet <Sheet>)
                                           (x integer plusp) (y integer plusp))
    ...)

 ;; Note that when you declare a return type for a method, the method
 ;; body will perform type-checking, but no toplevel DECLAIM form will
 ;; be generated.

 ;; CLOS function dispatch based on classes is limited; you cannot specialise
 ;; on user-defined types unless they are proper classes, for example.
 ;; You may therefore sometimes want to declare that a method's argument
 ;; is of a particular type, as well as declaring its class for specialisation
 ;; as you normally would.
 ;; Here is an example. Note the similarity to the syntax for keyword
 ;; arguments.
 (defmethod* (cell-value -> real) :around ((sheet <Sheet>)
                                           ((x natural plusp) integer)
                                           ((y natural plusp) integer))
    ...)

 ;; Example of DEFGENERIC*, mainly useful to declare the return type
 ;; of a set of methods.
 (defgeneric* (cell-value -> real) (sheet x y))

 ;; DEFGENERIC* can also be used to declare types of arguments. Be careful
 ;; that these don't clash with specialisers in method definitions.
 (defgeneric* (cell-value -> real) (sheet (x natural) (y natural)))
#+END_SRC

