doc/defstar.html

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Examples of DEFUN* and DEFMETHOD* usage</h3>
<div class="outline-text-3" id="text-1.3">





<pre class="src src-lisp"><span style="color: #db7093;">;; </span><span style="color: #db7093;">Define a simple function that adds two numbers, both of which
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">are declared to be real.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">sum</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Now also declare that the function returns a real.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">sum</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Another way of declaring the function's return type.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">sum</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span>returns <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">We want to ensure that a and b are never negative.
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">One way is to alter the type declarations:
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">sum</span> -&gt; <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span> <span style="color: #696969;">((</span>a <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span> <span style="color: #696969;">(</span>b <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #2e8b57;">0</span><span style="color: #696969;">)))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Another way is to define a new type:
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">deftype</span> <span style="color: #d2691e; font-weight: bold;">natural</span> <span style="color: #696969;">()</span> '<span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span>
<span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">sum</span> -&gt; natural<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>a natural<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>b natural<span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Another way is to use assertions:
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">sum</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #696969;">(</span>&gt;= return-value <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #696969;">(</span>&gt;= a <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #696969;">(</span>&gt;= b <span style="color: #2e8b57;">0</span><span style="color: #696969;">)))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Or:
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">sum</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #696969;">(</span>&gt;= a <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #696969;">(</span>&gt;= b <span style="color: #2e8b57;">0</span><span style="color: #696969;">)))</span>
   <span style="color: #696969;">(</span>returns <span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #696969;">(</span>&gt;= return-value <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Or, using the feature that the names of single-argument predicate
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">functions can be used as assertions:
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">naturalp</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">boolean</span><span style="color: #696969;">)</span> <span style="color: #696969;">((</span>x <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">not</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">minusp</span> x<span style="color: #696969;">)))</span>
...
<span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">sum</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span> naturalp<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span> naturalp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span> naturalp<span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">A function that returns multiple values.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">floor</span> -&gt; <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">values</span> <span style="color: #1e90ff; font-weight: bold;">integer</span> <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">))</span> <span style="color: #696969;">((</span>n <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>d <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span>cl:floor n d<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">It is possible to use assertions with functions that return
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">multiple values. When a function is declared to return multiple
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">values, RETURN-VALUE will be bound to a LIST of those values.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">floor</span> <span style="color: #696969;">((</span>n <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>d <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span>returns <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">values</span> <span style="color: #1e90ff; font-weight: bold;">integer</span> <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">&lt;</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">second</span> return-value<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">first</span> return-value<span style="color: #696969;">)))</span>
   <span style="color: #696969;">(</span>cl:floor n d<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">To declare that a function returns an unspecified number of
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">values, of unspecified types:
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">floor</span> -&gt; <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">values</span><span style="color: #696969;">))</span> <span style="color: #696969;">((</span>n <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>d <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   ...<span style="color: #696969;">)</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">The type of a &amp;REST argument can be declared. The declaration
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">refers to the types of each element in the list of arguments
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">stored in the &amp;REST argument.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #d2691e; font-weight: bold;">&amp;rest</span> <span style="color: #696969;">(</span>numbers <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">apply</span> #'cl:+ numbers<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">More complicated lambda list.
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">Note that the function and its first argument do not have type
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">declarations.
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">Also note the syntax of typed keyword arguments:
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">((var TYPE [ASSERTION]) DEFAULT [SUPPLIEDP])
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">Note that &amp;OPTIONAL arguments use the same syntax.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">my-find</span> <span style="color: #696969;">(</span>item <span style="color: #696969;">(</span>seq <span style="color: #1e90ff; font-weight: bold;">sequence</span><span style="color: #696969;">)</span> <span style="color: #d2691e; font-weight: bold;">&amp;key</span> <span style="color: #696969;">(</span>from-end <span style="color: #1e90ff; font-weight: bold;">boolean</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">((</span>test <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">or</span> <span style="color: #1e90ff; font-weight: bold;">null</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">function</span> <span style="color: #696969;">(</span><span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">))))</span> <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">((</span>test-not <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">or</span> <span style="color: #1e90ff; font-weight: bold;">null</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">function</span> <span style="color: #696969;">(</span><span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">))))</span> <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">((</span>key <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">or</span> <span style="color: #1e90ff; font-weight: bold;">null</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">function</span> <span style="color: #696969;">(</span><span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">))))</span> <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span>
                 <span style="color: #696969;">(</span>start <span style="color: #1e90ff; font-weight: bold;">fixnum</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>end <span style="color: #1e90ff; font-weight: bold;">fixnum</span><span style="color: #696969;">))</span>
   ...function body...<span style="color: #696969;">)</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Example of method definition. All the arguments in the arglist are
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">normal 'specialised' arguments like you would usually find in a
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">method definition. The form still allows you to include an assertion
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">with each argument, however ('plusp' in this case).
</span><span style="color: #696969;">(</span>defmethod* <span style="color: #696969;">(</span>cell-value -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #4169e1;">:around</span> <span style="color: #696969;">((</span>sheet &lt;Sheet&gt;<span style="color: #696969;">)</span>
                                          <span style="color: #696969;">(</span>x <span style="color: #1e90ff; font-weight: bold;">integer</span> <span style="color: #1e90ff; font-weight: bold;">plusp</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>y <span style="color: #1e90ff; font-weight: bold;">integer</span> <span style="color: #1e90ff; font-weight: bold;">plusp</span><span style="color: #696969;">))</span>
   ...<span style="color: #696969;">)</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Note that when you declare a return type for a method, the method
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">body will perform type-checking, but no toplevel DECLAIM form will
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">be generated.
</span>
<span style="color: #db7093;">;; </span><span style="color: #db7093;">CLOS function dispatch based on classes is limited; you cannot specialise
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">on user-defined types unless they are proper classes, for example.
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">You may therefore sometimes want to declare that a method's argument
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">is of a particular type, as well as declaring its class for specialisation
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">as you normally would.
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">Here is an example. Note the similarity to the syntax for keyword
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">arguments.
</span><span style="color: #696969;">(</span>defmethod* <span style="color: #696969;">(</span>cell-value -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #4169e1;">:around</span> <span style="color: #696969;">((</span>sheet &lt;Sheet&gt;<span style="color: #696969;">)</span>
                                          <span style="color: #696969;">((</span>x natural <span style="color: #1e90ff; font-weight: bold;">plusp</span><span style="color: #696969;">)</span> <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span>
                                          <span style="color: #696969;">((</span>y natural <span style="color: #1e90ff; font-weight: bold;">plusp</span><span style="color: #696969;">)</span> <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">))</span>
   ...<span style="color: #696969;">)</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">Example of DEFGENERIC*, mainly useful to declare the return type
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">of a set of methods.
</span><span style="color: #696969;">(</span>defgeneric* <span style="color: #696969;">(</span>cell-value -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>sheet x y<span style="color: #696969;">))</span>

<span style="color: #db7093;">;; </span><span style="color: #db7093;">DEFGENERIC* can also be used to declare types of arguments. Be careful
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">that these don't clash with specialisers in method definitions.
</span><span style="color: #696969;">(</span>defgeneric* <span style="color: #696969;">(</span>cell-value -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>sheet <span style="color: #696969;">(</span>x natural<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>y natural<span style="color: #696969;">)))</span>
</pre>



</div>

</div>
