doc/defstar.org
** Examples of DEFVAR* and DEFPARAMETER* usage


#+BEGIN_SRC lisp
 (defvar* (*user-name* string) "Bob")
 (defparameter* (*file-position* (integer 0)) 0)
#+END_SRC

** Limitations

- Definitions of =SETF= methods cannot include return type declarations in the
  method 'header'. The return type can still be declared using a =(RETURNS ...)=
  form. For example:
#+BEGIN_SRC lisp
 (defmethod (setf (foo -> integer)) (...args...)   ; illegal
    ...)

 (defmethod (setf foo) (...args...)
    (returns integer)                  ; legal
    ...)
#+END_SRC

** Syntax highlighting of DEFSTAR macros in Emacs


Put the following code in your =.emacs= if you want =DEFVAR*= and other 
forms to appear in the same face as their normal counterparts, and if 
you want their docstrings to also be correctly identified as docstrings
rather than normal strings.

#+BEGIN_SRC lisp
 ;; fontify doc strings in correct face
 ;; lisp-mode already fontifies 'defun*' correctly
 (put 'defvar*   'doc-string-elt 3)
 (put 'defparameter*   'doc-string-elt 3)
 (put 'lambda*   'doc-string-elt 2)
 
 (defvar *lisp-special-forms*
       (regexp-opt '("defvar*"
                     "defconstant*"
                     "defparameter*"
                     "defgeneric*"
                     "defmethod*"
                     "lambda*"
                     "flet*"
                     "labels*") 'words))
 (font-lock-add-keywords 'lisp-mode
  `((,*lisp-special-forms* . font-lock-keyword-face)))
#+END_SRC

** External Symbols




*** External Global Variables

-----

# link target 2: <<*check-argument-types-explicitly..3f..*>>
# link target: <<variable *check-argument-types-explicitly..3f..*>>


**** External Variable: =*check-argument-types-explicitly?*=               :variable:


***** Value

: T

Type: =boolean=


***** Description

If non-nil, insert =CHECK-TYPE= clauses in the preamble of functions,
to force the function's arguments to be explicitly type-checked.

Technically, =DECLARE, DECLAIM= and the like do not actually check that
values stored in the associated variables conform to the declared type.
They merely constitute a promise /by the programmer/ that only values of
the specified type will be stored there. The consequences of storing
a string in a variable that is declared to be of type integer, are
undefined.

In practise, essentially all modern lisps do perform type checking
based on declarations, especially when the =SAFETY= setting is high. 





*** External Macros

-----

# link target 2: <<*let>>
# link target: <<macro *let>>


**** External Macro: =*let=                                                   :macro:


***** Syntax

#+BEGIN_SRC lisp
(*let CLAUSES &body BODY)
#+END_SRC

***** Arguments

- CLAUSES :: A series of zero or more clauses taking the form:
: clause =   VARNAME
:          | (VARNAME FORM)
:          | (VARNAME TYPE FORM)
- BODY :: The body of the form (implicit =progn=).
***** Description

Expands to a =LET*= form, but if any clauses contain type information,
that information is moved into a declaration at the beginning of the
form's body.
***** Example

#+BEGIN_SRC lisp
 (*let ((name "Bob")
        (age integer 40)
        (sex (member :male :female) :male))
    ...body...)
#+END_SRC


-----

# link target 2: <<defgeneric*>>
# link target: <<macro defgeneric*>>


**** External Macro: =defgeneric*=                                            :macro:


***** Syntax

#+BEGIN_SRC lisp
(defgeneric* FNAME GENERIC-ARGLIST &body OPTIONS)
#+END_SRC

***** Arguments

- FNAME :: Name of the generic function.
- GENERIC-ARGLIST :: Follows the same grammar the arglist for [[defun*]]
  forms, except that =&REST, &KEY= and =&OPTIONAL= arguments must be of the form:
  : arg =   VARNAME
  :       | (VARNAME TYPE)

