doc/defstar.html

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Examples of DEFVAR* and DEFPARAMETER* usage</h3>
<div class="outline-text-3" id="text-1.4">






<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defvar*</span> <span style="color: #696969;">(</span><span style="color: #00c5cd;">*user-name*</span> <span style="color: #1e90ff; font-weight: bold;">string</span><span style="color: #696969;">)</span> <span style="color: #008b00;">"Bob"</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defparameter*</span> <span style="color: #696969;">(</span><span style="color: #00c5cd;">*file-position*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">integer</span> <span style="color: #2e8b57;">0</span><span style="color: #696969;">))</span> <span style="color: #2e8b57;">0</span><span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Limitations</h3>
<div class="outline-text-3" id="text-1.5">


<ul>
<li>
Definitions of <code>SETF</code> methods cannot include return type declarations in the
method 'header'. The return type can still be declared using a <code>(RETURNS ...)</code>
form. For example:

</li>
</ul>


<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defmethod</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">setf</span> <span style="color: #696969;">(</span>foo -&gt; <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">))</span> <span style="color: #696969;">(</span>...args...<span style="color: #696969;">)</span>   <span style="color: #db7093;">; </span><span style="color: #db7093;">illegal
</span>   ...<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defmethod</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">setf</span> foo<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>...args...<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span>returns <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span>                  <span style="color: #db7093;">; </span><span style="color: #db7093;">legal
</span>   ...<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Syntax highlighting of DEFSTAR macros in Emacs</h3>
<div class="outline-text-3" id="text-1.6">



<p>
Put the following code in your <code>.emacs</code> if you want <code>DEFVAR*</code> and other 
forms to appear in the same face as their normal counterparts, and if 
you want their docstrings to also be correctly identified as docstrings
rather than normal strings.
</p>



<pre class="src src-lisp"><span style="color: #db7093;">;; </span><span style="color: #db7093;">fontify doc strings in correct face
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">lisp-mode already fontifies 'defun*' correctly
</span><span style="color: #696969;">(</span>put '<span style="color: #8b4789; font-weight: bold;">defvar*</span>   'doc-string-elt <span style="color: #2e8b57;">3</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>put '<span style="color: #8b4789; font-weight: bold;">defparameter*</span>   'doc-string-elt <span style="color: #2e8b57;">3</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>put '<span style="color: #8b4789; font-weight: bold;">lambda*</span>   'doc-string-elt <span style="color: #2e8b57;">2</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defvar</span> <span style="color: #00868b; font-weight: bold;">*lisp-special-forms*</span>
      <span style="color: #696969;">(</span>regexp-opt '<span style="color: #696969;">(</span><span style="color: #008b00;">"defvar*"</span>
                    <span style="color: #008b00;">"defconstant*"</span>
                    <span style="color: #008b00;">"defparameter*"</span>
                    <span style="color: #008b00;">"defgeneric*"</span>
                    <span style="color: #008b00;">"defmethod*"</span>
                    <span style="color: #008b00;">"lambda*"</span>
                    <span style="color: #008b00;">"flet*"</span>
                    <span style="color: #008b00;">"labels*"</span><span style="color: #696969;">)</span> 'words<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>font-lock-add-keywords 'lisp-mode
 `<span style="color: #696969;">((</span>,<span style="color: #00c5cd;">*lisp-special-forms*</span> . font-lock-keyword-face<span style="color: #696969;">)))</span>
</pre>



</div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7"><span class="section-number-3">1.7</span> External Symbols</h3>
<div class="outline-text-3" id="text-1.7">






</div>

<div id="outline-container-1.7.1" class="outline-4">
<h4 id="sec-1.7.1"><span class="section-number-4">1.7.1</span> External Global Variables</h4>
<div class="outline-text-4" id="text-1.7.1">



<hr/>

<p>
<a name="<b>check-argument-types-explicitly..3f..</b>" id="<b>check-argument-types-explicitly..3f..</b>"></a>
<a name="variable==*check-argument-types-explicitly..3f..*" id="variable==*check-argument-types-explicitly..3f..*"></a>
</p>


</div>

<div id="outline-container-1.7.1.1" class="outline-5">
<h5 id="sec-1.7.1.1"><span class="section-number-5">1.7.1.1</span> External Variable: <code>*check-argument-types-explicitly?*</code></h5>
<div class="outline-text-5" id="text-1.7.1.1">




</div>

<div id="outline-container-1.7.1.1.1" class="outline-6">
<h6 id="sec-1.7.1.1.1"><span class="section-number-6">1.7.1.1.1</span> Value</h6>
<div class="outline-text-6" id="text-1.7.1.1.1">


<pre class="example">
T
</pre>


<p>
Type: <code>boolean</code>
</p>

</div>

</div>

<div id="outline-container-1.7.1.1.2" class="outline-6">
<h6 id="sec-1.7.1.1.2"><span class="section-number-6">1.7.1.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1.7.1.1.2">


<p>
If non-nil, insert <code>CHECK-TYPE</code> clauses in the preamble of functions,
to force the function's arguments to be explicitly type-checked.
</p>
<p>
Technically, <code>DECLARE, DECLAIM</code> and the like do not actually check that
values stored in the associated variables conform to the declared type.
They merely constitute a promise <i>by the programmer</i> that only values of
the specified type will be stored there. The consequences of storing
a string in a variable that is declared to be of type integer, are
undefined.
</p>
<p>
In practise, essentially all modern lisps do perform type checking
based on declarations, especially when the <code>SAFETY</code> setting is high. 
</p>




</div>
</div>
</div>

</div>

<div id="outline-container-1.7.2" class="outline-4">
<h4 id="sec-1.7.2"><span class="section-number-4">1.7.2</span> External Macros</h4>
<div class="outline-text-4" id="text-1.7.2">



<hr/>

<p>
<a name="*let" id="*let"></a>
<a name="macro==*let" id="macro==*let"></a>
</p>


</div>

<div id="outline-container-1.7.2.1" class="outline-5">
<h5 id="sec-1.7.2.1"><span class="section-number-5">1.7.2.1</span> External Macro: <code>*let</code></h5>
<div class="outline-text-5" id="text-1.7.2.1">




</div>

<div id="outline-container-1.7.2.1.1" class="outline-6">
<h6 id="sec-1.7.2.1.1"><span class="section-number-6">1.7.2.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.1.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>*let CLAUSES <span style="color: #d2691e; font-weight: bold;">&amp;body</span> BODY<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.1.2" class="outline-6">
<h6 id="sec-1.7.2.1.2"><span class="section-number-6">1.7.2.1.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.7.2.1.2">


<dl>
<dt>CLAUSES</dt><dd>
A series of zero or more clauses taking the form:
<pre class="example">
clause =   VARNAME
         | (VARNAME FORM)
         | (VARNAME TYPE FORM)
</pre>

</dd>
<dt>BODY</dt><dd>
The body of the form (implicit <code>progn</code>).
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.7.2.1.3" class="outline-6">
<h6 id="sec-1.7.2.1.3"><span class="section-number-6">1.7.2.1.3</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.1.3">


<p>
Expands to a <code>LET*</code> form, but if any clauses contain type information,
that information is moved into a declaration at the beginning of the
form's body.
</p></div>

</div>

<div id="outline-container-1.7.2.1.4" class="outline-6">
<h6 id="sec-1.7.2.1.4"><span class="section-number-6">1.7.2.1.4</span> Example</h6>
<div class="outline-text-6" id="text-1.7.2.1.4">





<pre class="src src-lisp"><span style="color: #696969;">(</span>*let <span style="color: #696969;">((</span>name <span style="color: #008b00;">"Bob"</span><span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span>age <span style="color: #1e90ff; font-weight: bold;">integer</span> <span style="color: #2e8b57;">40</span><span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span>sex <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">member</span> <span style="color: #4169e1;">:male</span> <span style="color: #4169e1;">:female</span><span style="color: #696969;">)</span> <span style="color: #4169e1;">:male</span><span style="color: #696969;">))</span>
   ...body...<span style="color: #696969;">)</span>
</pre>





<hr/>

<p>
<a name="defgeneric*" id="defgeneric*"></a>
<a name="macro==defgeneric*" id="macro==defgeneric*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.2" class="outline-5">
<h5 id="sec-1.7.2.2"><span class="section-number-5">1.7.2.2</span> External Macro: <code>defgeneric*</code></h5>
<div class="outline-text-5" id="text-1.7.2.2">




</div>

<div id="outline-container-1.7.2.2.1" class="outline-6">
<h6 id="sec-1.7.2.2.1"><span class="section-number-6">1.7.2.2.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.2.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>defgeneric* FNAME GENERIC-ARGLIST <span style="color: #d2691e; font-weight: bold;">&amp;body</span> OPTIONS<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.2.2" class="outline-6">
<h6 id="sec-1.7.2.2.2"><span class="section-number-6">1.7.2.2.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.7.2.2.2">


<dl>
<dt>FNAME</dt><dd>
Name of the generic function.
</dd>
<dt>GENERIC-ARGLIST</dt><dd>
Follows the same grammar the arglist for <a href="#defun*">defun*</a>
forms, except that <code>&amp;REST, &amp;KEY</code> and <code>&amp;OPTIONAL</code> arguments must be of the form:
<pre class="example">
arg =   VARNAME
      | (VARNAME TYPE)
</pre>


</dd>
</dl>
</div>

</div>
