doc/defstar.org
***** Description

Usage is exactly the same as [[defun*]], except that value-checking assertions
are ignored.

Note that you can declare types for arguments in the generic function
argument list. Be careful that these do not clash with method definitions.
Type declarations for generic function arguments will only be used to
make a toplevel =DECLAIM= form that will then apply to all methods of
the generic function.

***** Examples:

#+BEGIN_SRC lisp
 (defgeneric* (length -> integer) (seq &key start) ...options...)

 (defgeneric* (length -> integer) ((seq sequence) &key (start integer))
    ...options...)
#+END_SRC


-----

# link target 2: <<defmethod*>>
# link target: <<macro defmethod*>>


**** External Macro: =defmethod*=                                             :macro:


***** Syntax

#+BEGIN_SRC lisp
(defmethod* FNAME METHOD-ARGLIST &body BODY)
#+END_SRC

***** Arguments


Usage is exactly the same as [[defun*]], except that within =METHOD-ARGLIST=,
any list in a non-optional position (prior to any =&key, &rest,= or =&optional=
keyword) is assumed to be a specialised lambda list term of the form =(VARNAME
CLASS [assertion])=, rather than a DEFUN* type-declaring term.

The syntax of METHOD-ARGLIST is therefore:
: arglist =   method-term*
:           | (method-term* [&optional opt-term+])
:           | (method-term* [&key opt-term+])
:           | (method-term* [&rest rest-term])
: method-term = VARNAME
:               | (VARNAME CLASS [assertion])
:               | ((VARNAME TYPE/CLASS [assertion]) CLASS)
The rest of the syntax is the same as for DEFUN*.

***** Description

Equivalent to =(DEFMETHOD FNAME METHOD-ARGLIST . body)= with type declarations
and assertions as per [[defun*]].

***** Examples

#+BEGIN_SRC lisp
 (deftype positive-integer () `(integer 1))

 (defmethod (make-coords -> (cons positive-integer positive-integer))
                (((x positive-integer) integer)
                 ((y positive-integer) integer))
    (cons x y))
#+END_SRC


-----

# link target 2: <<defparameter*>>
# link target: <<macro defparameter*>>


**** External Macro: =defparameter*=                                          :macro:


***** Syntax

#+BEGIN_SRC lisp
(defparameter* VAR VALUE &optional DOCSTRING)
#+END_SRC

***** Description

Like [[defvar*]], but expands to =DEFPARAMETER= rather than =DEFVAR=.
See [[defvar*]] for more details.


-----

# link target 2: <<defun*>>
# link target: <<macro defun*>>


**** External Macro: =defun*=                                                 :macro:


***** Syntax

#+BEGIN_SRC lisp
(defun* FNAME ARGLIST &body BODY)
#+END_SRC

***** Arguments

- FNAME :: either the name of the function to be created, or a list with the
  following grammar:
  : fname =   FUNCTION-NAME
  :         | (FUNCTION-NAME -> TYPE [assertion])
  : assertion =       FORM
  :                 | PREDICATE-SYMBOL
  Where:
  - =TYPE= is any valid type specifier
  - =FORM= is any form, which must return non-nil if the assertion is satisfied,
    nil otherwise. Within the form, the symbol =RETURN-VALUE= is bound to the
    value that is about to be returned by the function.
  - =PREDICATE-SYMBOL= is a symbol, the name of a function that accepts a single
    argument. Equivalent to the form =(PREDICATE-SYMBOL RETURN-VALUE)=.

    /Note:/ if the latter (list) form for fname is used, the =DEFUN*= body may
    /not/ also contain a =returns= form. Also note that the latter form cannot
    currently be used when defining a =(setf ...)= function or method.
- ARGLIST :: a =DEFUN*= LAMBDA LIST, which uses the following grammar:
  : arglist =   var-term*
  :           | (var-term* [&optional opt-term+])
  :           | (var-term* [&key opt-term+])
  :           | (var-term* [&rest rest-term])
  : var-term =        VARNAME
  :                 | (VARNAME TYPE/CLASS [assertion])
  : rest-term =       VARNAME
  :                 | (VARNAME ELEMENT-TYPE)
  : opt-term =        VARNAME
  :                 | (var-term DEFAULT [SUPPLIEDP])
  Where:
  - =VARNAME= is a symbol that will name the variable bound to the function
    argument.
  - =TYPE/CLASS= and =ELEMENT-TYPE= are forms that are legal type
    declarations. For example, the name of a simple type or class, or a list if
    the type declaration is more complex.
  - =DEFAULT= and =SUPPLIED-P= are the default value, and a variable that will
    indicate whether the argument was supplied.
- BODY :: Body of the function form. This may contain a docstring in the usual
  place, and may also a single special form beginning with =returns=:
  : returns-form = (RETURNS TYPE [assertion])
  If the =returns= form contains an assertion, then within that assertion,
  the symbol =return-value= is bound to the value that the function is
  about to return.

