doc/defstar.html

<div id="outline-container-1.7.2.2.3" class="outline-6">
<h6 id="sec-1.7.2.2.3"><span class="section-number-6">1.7.2.2.3</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.2.3">


<p>
Usage is exactly the same as <a href="#defun*">defun*</a>, except that value-checking assertions
are ignored.
</p>
<p>
Note that you can declare types for arguments in the generic function
argument list. Be careful that these do not clash with method definitions.
Type declarations for generic function arguments will only be used to
make a toplevel <code>DECLAIM</code> form that will then apply to all methods of
the generic function.
</p>
</div>

</div>

<div id="outline-container-1.7.2.2.4" class="outline-6">
<h6 id="sec-1.7.2.2.4"><span class="section-number-6">1.7.2.2.4</span> Examples:</h6>
<div class="outline-text-6" id="text-1.7.2.2.4">





<pre class="src src-lisp"><span style="color: #696969;">(</span>defgeneric* <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">length</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>seq <span style="color: #d2691e; font-weight: bold;">&amp;key</span> start<span style="color: #696969;">)</span> ...options...<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>defgeneric* <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">length</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span> <span style="color: #696969;">((</span>seq <span style="color: #1e90ff; font-weight: bold;">sequence</span><span style="color: #696969;">)</span> <span style="color: #d2691e; font-weight: bold;">&amp;key</span> <span style="color: #696969;">(</span>start <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">))</span>
   ...options...<span style="color: #696969;">)</span>
</pre>





<hr/>

<p>
<a name="defmethod*" id="defmethod*"></a>
<a name="macro==defmethod*" id="macro==defmethod*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.3" class="outline-5">
<h5 id="sec-1.7.2.3"><span class="section-number-5">1.7.2.3</span> External Macro: <code>defmethod*</code></h5>
<div class="outline-text-5" id="text-1.7.2.3">




</div>

<div id="outline-container-1.7.2.3.1" class="outline-6">
<h6 id="sec-1.7.2.3.1"><span class="section-number-6">1.7.2.3.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.3.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>defmethod* FNAME METHOD-ARGLIST <span style="color: #d2691e; font-weight: bold;">&amp;body</span> BODY<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.3.2" class="outline-6">
<h6 id="sec-1.7.2.3.2"><span class="section-number-6">1.7.2.3.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.7.2.3.2">



<p>
Usage is exactly the same as <a href="#defun*">defun*</a>, except that within <code>METHOD-ARGLIST</code>,
any list in a non-optional position (prior to any <code>&amp;key, &amp;rest,= or =&amp;optional</code>
keyword) is assumed to be a specialised lambda list term of the form <code>(VARNAME CLASS [assertion])</code>, rather than a DEFUN* type-declaring term.
</p>
<p>
The syntax of METHOD-ARGLIST is therefore:
</p><pre class="example">
arglist =   method-term*
          | (method-term* [&amp;optional opt-term+])
          | (method-term* [&amp;key opt-term+])
          | (method-term* [&amp;rest rest-term])
method-term = VARNAME
              | (VARNAME CLASS [assertion])
              | ((VARNAME TYPE/CLASS [assertion]) CLASS)
</pre>

<p>The rest of the syntax is the same as for DEFUN*.
</p>
</div>

</div>

<div id="outline-container-1.7.2.3.3" class="outline-6">
<h6 id="sec-1.7.2.3.3"><span class="section-number-6">1.7.2.3.3</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.3.3">


<p>
Equivalent to <code>(DEFMETHOD FNAME METHOD-ARGLIST . body)</code> with type declarations
and assertions as per <a href="#defun*">defun*</a>.
</p>
</div>

</div>

<div id="outline-container-1.7.2.3.4" class="outline-6">
<h6 id="sec-1.7.2.3.4"><span class="section-number-6">1.7.2.3.4</span> Examples</h6>
<div class="outline-text-6" id="text-1.7.2.3.4">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">deftype</span> <span style="color: #d2691e; font-weight: bold;">positive-integer</span> <span style="color: #696969;">()</span> `<span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">integer</span> <span style="color: #2e8b57;">1</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defmethod</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">make-coords</span> -&gt; <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">cons</span> positive-integer positive-integer<span style="color: #696969;">))</span>
               <span style="color: #696969;">(((</span>x positive-integer<span style="color: #696969;">)</span> <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span>
                <span style="color: #696969;">((</span>y positive-integer<span style="color: #696969;">)</span> <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">))</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">cons</span> x y<span style="color: #696969;">))</span>
</pre>





<hr/>

<p>
<a name="defparameter*" id="defparameter*"></a>
<a name="macro==defparameter*" id="macro==defparameter*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.4" class="outline-5">
<h5 id="sec-1.7.2.4"><span class="section-number-5">1.7.2.4</span> External Macro: <code>defparameter*</code></h5>
<div class="outline-text-5" id="text-1.7.2.4">




</div>

<div id="outline-container-1.7.2.4.1" class="outline-6">
<h6 id="sec-1.7.2.4.1"><span class="section-number-6">1.7.2.4.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.4.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defparameter*</span> VAR VALUE <span style="color: #d2691e; font-weight: bold;">&amp;optional</span> DOCSTRING<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.4.2" class="outline-6">
<h6 id="sec-1.7.2.4.2"><span class="section-number-6">1.7.2.4.2</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.4.2">


<p>
Like <a href="#defvar*">defvar*</a>, but expands to <code>DEFPARAMETER</code> rather than <code>DEFVAR</code>.
See <a href="#defvar*">defvar*</a> for more details.
</p>


<hr/>

<p>
<a name="defun*" id="defun*"></a>
<a name="macro==defun*" id="macro==defun*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.5" class="outline-5">
<h5 id="sec-1.7.2.5"><span class="section-number-5">1.7.2.5</span> External Macro: <code>defun*</code></h5>
<div class="outline-text-5" id="text-1.7.2.5">




</div>

<div id="outline-container-1.7.2.5.1" class="outline-6">
<h6 id="sec-1.7.2.5.1"><span class="section-number-6">1.7.2.5.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.5.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">FNAME</span> ARGLIST <span style="color: #d2691e; font-weight: bold;">&amp;body</span> BODY<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.5.2" class="outline-6">
<h6 id="sec-1.7.2.5.2"><span class="section-number-6">1.7.2.5.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.7.2.5.2">


<dl>
<dt>FNAME</dt><dd>
either the name of the function to be created, or a list with the
following grammar:
<pre class="example">
fname =   FUNCTION-NAME
        | (FUNCTION-NAME -&gt; TYPE [assertion])
assertion =       FORM
                | PREDICATE-SYMBOL
</pre>

<p>Where:
</p><ul>
<li>
<code>TYPE</code> is any valid type specifier
</li>
<li>
<code>FORM</code> is any form, which must return non-nil if the assertion is satisfied,
nil otherwise. Within the form, the symbol <code>RETURN-VALUE</code> is bound to the
value that is about to be returned by the function.
</li>
<li>
<code>PREDICATE-SYMBOL</code> is a symbol, the name of a function that accepts a single
argument. Equivalent to the form <code>(PREDICATE-SYMBOL RETURN-VALUE)</code>.

<p>
<i>Note:</i> if the latter (list) form for fname is used, the <code>DEFUN*</code> body may
<i>not</i> also contain a <code>returns</code> form. Also note that the latter form cannot
currently be used when defining a <code>(setf ...)</code> function or method.
</p></li>
</ul>
</dd>
<dt>ARGLIST</dt><dd>
a <code>DEFUN*</code> LAMBDA LIST, which uses the following grammar:
<pre class="example">
arglist =   var-term*
          | (var-term* [&amp;optional opt-term+])
          | (var-term* [&amp;key opt-term+])
          | (var-term* [&amp;rest rest-term])
var-term =        VARNAME
                | (VARNAME TYPE/CLASS [assertion])
rest-term =       VARNAME
                | (VARNAME ELEMENT-TYPE)
opt-term =        VARNAME
                | (var-term DEFAULT [SUPPLIEDP])
</pre>

<p>Where:
</p><ul>
<li>
<code>VARNAME</code> is a symbol that will name the variable bound to the function
argument.
</li>
<li>
<code>TYPE/CLASS</code> and <code>ELEMENT-TYPE</code> are forms that are legal type
declarations. For example, the name of a simple type or class, or a list if
the type declaration is more complex.
</li>
<li>
<code>DEFAULT</code> and <code>SUPPLIED-P</code> are the default value, and a variable that will
indicate whether the argument was supplied.
</li>
</ul>
</dd>
<dt>BODY</dt><dd>
Body of the function form. This may contain a docstring in the usual
place, and may also a single special form beginning with <code>returns</code>:
<pre class="example">
returns-form = (RETURNS TYPE [assertion])
</pre>

<p>If the <code>returns</code> form contains an assertion, then within that assertion,
the symbol <code>return-value</code> is bound to the value that the function is
about to return.
</p>
</dd>
</dl>
</div>

</div>
