doc/defstar.org
***** Description

Equivalent to =(DEFUN fname arglist . body)=, but:
- All type declarations within the lambda list will be turned into =(DECLARE...)=
  forms within the function body
- If a return type is declared for the function itself, this will be turned
  into a global =DECLAIM= form that immediately precedes the function.
- All assertions within the lambda list will be checked before the function body
  is entered.
- Any assertion within a =returns= form will be checked before the function
  returns a value.

***** Examples

#+BEGIN_SRC lisp
 ;; Very simple example
 (defun* (add -> real) ((a real) (b real))
   (+ a b))
#+END_SRC

#+BEGIN_SRC lisp
 ;; Example with assertion for 'b' argument, checked before the
 ;; body of the function is entered.
 (defun* div ((a real) (b real (/= b 0)))
    (returns real)
    (/ a b))
#+END_SRC

#+BEGIN_SRC lisp
 (defun* sum (&rest (nums real))  ; type of 'rest' var refers to
    (returns real)                ; the type of each list element, ie
    (apply #'+ nums))             ; nums must be a list of REALs
#+END_SRC

#+BEGIN_SRC lisp
 (defun* (sum -> real) (&rest (nums real))  ; alternative form
    (apply #'+ nums))                       ; for above example
#+END_SRC

#+BEGIN_SRC lisp
 ;; This function and first argument have no type declarations.
 ;; Keyword argument 'test' accepts a function that takes
 ;; two arguments of any type.
 (defun* find-in-tree (item (tree cons)
                       &key ((test (function (t t))) #'equal))
  (or (funcall test item tree)
      (and (consp tree)
           (or (find-in-tree item (car tree))
               (find-in-tree item (cdr tree))))))
#+END_SRC


-----

# link target 2: <<defvar*>>
# link target: <<macro defvar*>>


**** External Macro: =defvar*=                                                :macro:


***** Syntax

#+BEGIN_SRC lisp
(defvar* VAR VALUE &optional DOCSTRING)
#+END_SRC

***** Arguments

- VAR :: either:
  1. A variable name: in this case =DEFVAR*= has exactly the same effect as
     =DEFVAR=.
  2. =(VARNAME TYPE)= where =VARNAME= is a variable name and =TYPE= is a type
     declaration.
- VALUE :: A form which is evaluated when the variable is first created.
- DOCSTRING :: Documentation string.

***** Returns

The name of the variable as a symbol.

***** Description

Creates the global special variable =VAR=, initialises it to =VALUE=,
and declares it to be of type =TYPE=, if given.

***** Examples

#+BEGIN_SRC lisp
 (defvar* (*file-name* string) "~/log.txt") 
#+END_SRC


-----

# link target 2: <<flet*>>
# link target: <<macro flet*>>


**** External Macro: =flet*=                                                  :macro:


***** Syntax

#+BEGIN_SRC lisp
(flet* CLAUSES &body BODY)
#+END_SRC

***** Arguments

- CLAUSES :: List of clauses. Takes the following grammar:
  : clauses = clause*
  : clause  = (FNAME ARGLIST ...body...)
  See [[defun*]] for a description of the grammar of =FNAME= and =ARGLIST=.
- BODY :: Body of the form.

***** Description

Like =FLET=, but within each function-definition clause the function name,
arglist and body have the same syntax as for [[defun*]].

