doc/defstar.html

<div id="outline-container-1.7.2.5.3" class="outline-6">
<h6 id="sec-1.7.2.5.3"><span class="section-number-6">1.7.2.5.3</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.5.3">


<p>
Equivalent to <code>(DEFUN fname arglist . body)</code>, but:
</p><ul>
<li>
All type declarations within the lambda list will be turned into <code>(DECLARE...)</code>
forms within the function body
</li>
<li>
If a return type is declared for the function itself, this will be turned
into a global <code>DECLAIM</code> form that immediately precedes the function.
</li>
<li>
All assertions within the lambda list will be checked before the function body
is entered.
</li>
<li>
Any assertion within a <code>returns</code> form will be checked before the function
returns a value.

</li>
</ul>
</div>

</div>

<div id="outline-container-1.7.2.5.4" class="outline-6">
<h6 id="sec-1.7.2.5.4"><span class="section-number-6">1.7.2.5.4</span> Examples</h6>
<div class="outline-text-6" id="text-1.7.2.5.4">





<pre class="src src-lisp"><span style="color: #db7093;">;; </span><span style="color: #db7093;">Very simple example
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">add</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">+</span> a b<span style="color: #696969;">))</span>
</pre>




<pre class="src src-lisp"><span style="color: #db7093;">;; </span><span style="color: #db7093;">Example with assertion for 'b' argument, checked before the
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">body of the function is entered.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">div</span> <span style="color: #696969;">((</span>a <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>b <span style="color: #1e90ff; font-weight: bold;">real</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">/=</span> b <span style="color: #2e8b57;">0</span><span style="color: #696969;">)))</span>
   <span style="color: #696969;">(</span>returns <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">/</span> a b<span style="color: #696969;">))</span>
</pre>




<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">sum</span> <span style="color: #696969;">(</span><span style="color: #d2691e; font-weight: bold;">&amp;rest</span> <span style="color: #696969;">(</span>nums <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>  <span style="color: #db7093;">; </span><span style="color: #db7093;">type of 'rest' var refers to
</span>   <span style="color: #696969;">(</span>returns <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span>                <span style="color: #db7093;">; </span><span style="color: #db7093;">the type of each list element, ie
</span>   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">apply</span> #'<span style="color: #1e90ff; font-weight: bold;">+</span> nums<span style="color: #696969;">))</span>             <span style="color: #db7093;">; </span><span style="color: #db7093;">nums must be a list of REALs
</span></pre>




<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">sum</span> -&gt; <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #d2691e; font-weight: bold;">&amp;rest</span> <span style="color: #696969;">(</span>nums <span style="color: #1e90ff; font-weight: bold;">real</span><span style="color: #696969;">))</span>  <span style="color: #db7093;">; </span><span style="color: #db7093;">alternative form
</span>   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">apply</span> #'<span style="color: #1e90ff; font-weight: bold;">+</span> nums<span style="color: #696969;">))</span>                       <span style="color: #db7093;">; </span><span style="color: #db7093;">for above example
</span></pre>




<pre class="src src-lisp"><span style="color: #db7093;">;; </span><span style="color: #db7093;">This function and first argument have no type declarations.
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">Keyword argument 'test' accepts a function that takes
</span><span style="color: #db7093;">;; </span><span style="color: #db7093;">two arguments of any type.
</span><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun*</span> <span style="color: #1e90ff; font-weight: bold;">find-in-tree</span> <span style="color: #696969;">(</span>item <span style="color: #696969;">(</span>tree <span style="color: #1e90ff; font-weight: bold;">cons</span><span style="color: #696969;">)</span>
                      <span style="color: #d2691e; font-weight: bold;">&amp;key</span> <span style="color: #696969;">((</span>test <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">function</span> <span style="color: #696969;">(</span><span style="color: #698b22; font-weight: bold;">t</span> <span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">)))</span> #'<span style="color: #1e90ff; font-weight: bold;">equal</span><span style="color: #696969;">))</span>
 <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">or</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">funcall</span> test item tree<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">and</span> <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">consp</span> tree<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">or</span> <span style="color: #696969;">(</span>find-in-tree item <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">car</span> tree<span style="color: #696969;">))</span>
              <span style="color: #696969;">(</span>find-in-tree item <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">cdr</span> tree<span style="color: #696969;">))))))</span>
</pre>





<hr/>

<p>
<a name="defvar*" id="defvar*"></a>
<a name="macro==defvar*" id="macro==defvar*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.6" class="outline-5">
<h5 id="sec-1.7.2.6"><span class="section-number-5">1.7.2.6</span> External Macro: <code>defvar*</code></h5>
<div class="outline-text-5" id="text-1.7.2.6">




</div>

<div id="outline-container-1.7.2.6.1" class="outline-6">
<h6 id="sec-1.7.2.6.1"><span class="section-number-6">1.7.2.6.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.6.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defvar*</span> VAR VALUE <span style="color: #d2691e; font-weight: bold;">&amp;optional</span> DOCSTRING<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.6.2" class="outline-6">
<h6 id="sec-1.7.2.6.2"><span class="section-number-6">1.7.2.6.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.7.2.6.2">


<dl>
<dt>VAR</dt><dd>
either:
<ol>
<li>
A variable name: in this case <code>DEFVAR*</code> has exactly the same effect as
<code>DEFVAR</code>.
</li>
<li>
<code>(VARNAME TYPE)</code> where <code>VARNAME</code> is a variable name and <code>TYPE</code> is a type
declaration.
</li>
</ol>
</dd>
<dt>VALUE</dt><dd>
A form which is evaluated when the variable is first created.
</dd>
<dt>DOCSTRING</dt><dd>
Documentation string.

</dd>
</dl>
</div>

</div>

<div id="outline-container-1.7.2.6.3" class="outline-6">
<h6 id="sec-1.7.2.6.3"><span class="section-number-6">1.7.2.6.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.7.2.6.3">


<p>
The name of the variable as a symbol.
</p>
</div>

</div>

<div id="outline-container-1.7.2.6.4" class="outline-6">
<h6 id="sec-1.7.2.6.4"><span class="section-number-6">1.7.2.6.4</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.6.4">


<p>
Creates the global special variable <code>VAR</code>, initialises it to <code>VALUE</code>,
and declares it to be of type <code>TYPE</code>, if given.
</p>
</div>

</div>

<div id="outline-container-1.7.2.6.5" class="outline-6">
<h6 id="sec-1.7.2.6.5"><span class="section-number-6">1.7.2.6.5</span> Examples</h6>
<div class="outline-text-6" id="text-1.7.2.6.5">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defvar*</span> <span style="color: #696969;">(</span><span style="color: #00c5cd;">*file-name*</span> <span style="color: #1e90ff; font-weight: bold;">string</span><span style="color: #696969;">)</span> <span style="color: #008b00;">"~/log.txt"</span><span style="color: #696969;">)</span> 
</pre>





<hr/>

<p>
<a name="flet*" id="flet*"></a>
<a name="macro==flet*" id="macro==flet*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.7" class="outline-5">
<h5 id="sec-1.7.2.7"><span class="section-number-5">1.7.2.7</span> External Macro: <code>flet*</code></h5>
<div class="outline-text-5" id="text-1.7.2.7">




</div>

<div id="outline-container-1.7.2.7.1" class="outline-6">
<h6 id="sec-1.7.2.7.1"><span class="section-number-6">1.7.2.7.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.7.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">flet*</span> CLAUSES <span style="color: #d2691e; font-weight: bold;">&amp;body</span> BODY<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.7.2" class="outline-6">
<h6 id="sec-1.7.2.7.2"><span class="section-number-6">1.7.2.7.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.7.2.7.2">


<dl>
<dt>CLAUSES</dt><dd>
List of clauses. Takes the following grammar:
<pre class="example">
clauses = clause*
clause  = (FNAME ARGLIST ...body...)
</pre>

<p>See <a href="#defun*">defun*</a> for a description of the grammar of <code>FNAME</code> and <code>ARGLIST</code>.
</p></dd>
<dt>BODY</dt><dd>
Body of the form.

</dd>
</dl>
</div>

</div>

<div id="outline-container-1.7.2.7.3" class="outline-6">
<h6 id="sec-1.7.2.7.3"><span class="section-number-6">1.7.2.7.3</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.7.3">


<p>
Like <code>FLET</code>, but within each function-definition clause the function name,
arglist and body have the same syntax as for <a href="#defun*">defun*</a>.
</p>
</div>

</div>
