doc/defstar.org
***** Examples

#+BEGIN_SRC lisp
 (defun foo (name x y)
    (flet* (((area -> integer) ((x integer) (y integer))
              (* x y)))
       (format t "Area of ~A is ~D.~%" name (area x y))))
#+END_SRC


-----

# link target 2: <<labels*>>
# link target: <<macro labels*>>


**** External Macro: =labels*=                                                :macro:


***** Syntax

#+BEGIN_SRC lisp
(labels* CLAUSES &body BODY)
#+END_SRC

***** Arguments

See [[flet*]].

***** Description

Like =LABELS=, but within each clause the function name, arglist and body have
the same syntax as for [[defun*]].

See [[flet*]] for more details.


-----

# link target 2: <<lambda*>>
# link target: <<macro lambda*>>


**** External Macro: =lambda*=                                                :macro:


***** Syntax

#+BEGIN_SRC lisp
(lambda* ARGLIST &body BODY)
#+END_SRC

***** Description

Like =LAMBDA=, but =ARGLIST= and body have the same syntax as for [[defun*]].
 A =returns= form can be used within the function body to
declare its return type.





** Index

 [[index D][D]]  [[index F][F]]  [[index L][L]]  [[index
NONALPHABETIC][NONALPHABETIC]]  


*** Nonalphabetic


# link target: <<index NONALPHABETIC>>
- [[variable *check-argument-types-explicitly..3f..*][=*check-argument-types
  explicitly?*=]], Variable
- [[macro *let][=*let=]], Macro



*** D


# link target: <<index D>>
- [[macro defgeneric*][=defgeneric*=]], Macro
- [[macro defmethod*][=defmethod*=]], Macro
- [[macro defparameter*][=defparameter*=]], Macro
- [[macro defun*][=defun*=]], Macro
- [[macro defvar*][=defvar*=]], Macro



*** F


# link target: <<index F>>
- [[macro flet*][=flet*=]], Macro



*** L


# link target: <<index L>>
- [[macro labels*][=labels*=]], Macro
- [[macro lambda*][=lambda*=]], Macro





* Colophon

This documentation was generated from Common Lisp source code using CLOD, version 1.0.
The latest version of CLOD is available [[http://bitbucket.org/eeeickythump/clod/][here]].
