doc/defstar.html

<div id="outline-container-1.7.2.7.4" class="outline-6">
<h6 id="sec-1.7.2.7.4"><span class="section-number-6">1.7.2.7.4</span> Examples</h6>
<div class="outline-text-6" id="text-1.7.2.7.4">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun</span> <span style="color: #1e90ff; font-weight: bold;">foo</span> <span style="color: #696969;">(</span>name x y<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">flet*</span> <span style="color: #696969;">(((</span>area -&gt; <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span> <span style="color: #696969;">((</span>x <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>y <span style="color: #1e90ff; font-weight: bold;">integer</span><span style="color: #696969;">))</span>
             <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">*</span> x y<span style="color: #696969;">)))</span>
      <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">format</span> <span style="color: #698b22; font-weight: bold;">t</span> <span style="color: #008b00;">"Area of ~A is ~D.~%"</span> name <span style="color: #696969;">(</span>area x y<span style="color: #696969;">))))</span>
</pre>





<hr/>

<p>
<a name="labels*" id="labels*"></a>
<a name="macro==labels*" id="macro==labels*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.8" class="outline-5">
<h5 id="sec-1.7.2.8"><span class="section-number-5">1.7.2.8</span> External Macro: <code>labels*</code></h5>
<div class="outline-text-5" id="text-1.7.2.8">




</div>

<div id="outline-container-1.7.2.8.1" class="outline-6">
<h6 id="sec-1.7.2.8.1"><span class="section-number-6">1.7.2.8.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.8.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">labels*</span> CLAUSES <span style="color: #d2691e; font-weight: bold;">&amp;body</span> BODY<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.8.2" class="outline-6">
<h6 id="sec-1.7.2.8.2"><span class="section-number-6">1.7.2.8.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.7.2.8.2">


<p>
See <a href="#flet*">flet*</a>.
</p>
</div>

</div>

<div id="outline-container-1.7.2.8.3" class="outline-6">
<h6 id="sec-1.7.2.8.3"><span class="section-number-6">1.7.2.8.3</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.8.3">


<p>
Like <code>LABELS</code>, but within each clause the function name, arglist and body have
the same syntax as for <a href="#defun*">defun*</a>.
</p>
<p>
See <a href="#flet*">flet*</a> for more details.
</p>


<hr/>

<p>
<a name="lambda*" id="lambda*"></a>
<a name="macro==lambda*" id="macro==lambda*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.7.2.9" class="outline-5">
<h5 id="sec-1.7.2.9"><span class="section-number-5">1.7.2.9</span> External Macro: <code>lambda*</code></h5>
<div class="outline-text-5" id="text-1.7.2.9">




</div>

<div id="outline-container-1.7.2.9.1" class="outline-6">
<h6 id="sec-1.7.2.9.1"><span class="section-number-6">1.7.2.9.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.7.2.9.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">lambda*</span> ARGLIST <span style="color: #d2691e; font-weight: bold;">&amp;body</span> BODY<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.7.2.9.2" class="outline-6">
<h6 id="sec-1.7.2.9.2"><span class="section-number-6">1.7.2.9.2</span> Description</h6>
<div class="outline-text-6" id="text-1.7.2.9.2">


<p>
Like <code>LAMBDA</code>, but <code>ARGLIST</code> and body have the same syntax as for <a href="#defun*">defun*</a>.
A <code>returns</code> form can be used within the function body to
declare its return type.
</p>




</div>
</div>
</div>
</div>

</div>

<div id="outline-container-1.8" class="outline-3">
<h3 id="sec-1.8"><span class="section-number-3">1.8</span> Index</h3>
<div class="outline-text-3" id="text-1.8">


<p>
<a href="#index==D">D</a>  <a href="#index==F">F</a>  <a href="#index==L">L</a>  <a href="#index==NONALPHABETIC">NONALPHABETIC</a>  
</p>


</div>

<div id="outline-container-1.8.1" class="outline-4">
<h4 id="sec-1.8.1"><span class="section-number-4">1.8.1</span> Nonalphabetic</h4>
<div class="outline-text-4" id="text-1.8.1">



<p>
<a name="index==NONALPHABETIC" id="index==NONALPHABETIC"></a>
</p><ul>
<li>
<a href="#variable==*check-argument-types-explicitly..3f..*"><code>*check-argument-types explicitly?*</code></a>, Variable
</li>
<li>
<a href="#macro==*let"><code>*let</code></a>, Macro



</li>
</ul>
</div>

</div>

<div id="outline-container-1.8.2" class="outline-4">
<h4 id="sec-1.8.2"><span class="section-number-4">1.8.2</span> D</h4>
<div class="outline-text-4" id="text-1.8.2">



<p>
<a name="index==D" id="index==D"></a>
</p><ul>
<li>
<a href="#macro==defgeneric*"><code>defgeneric*</code></a>, Macro
</li>
<li>
<a href="#macro==defmethod*"><code>defmethod*</code></a>, Macro
</li>
<li>
<a href="#macro==defparameter*"><code>defparameter*</code></a>, Macro
</li>
<li>
<a href="#macro==defun*"><code>defun*</code></a>, Macro
</li>
<li>
<a href="#macro==defvar*"><code>defvar*</code></a>, Macro



</li>
</ul>
</div>

</div>

<div id="outline-container-1.8.3" class="outline-4">
<h4 id="sec-1.8.3"><span class="section-number-4">1.8.3</span> F</h4>
<div class="outline-text-4" id="text-1.8.3">



<p>
<a name="index==F" id="index==F"></a>
</p><ul>
<li>
<a href="#macro==flet*"><code>flet*</code></a>, Macro



</li>
</ul>
</div>

</div>

<div id="outline-container-1.8.4" class="outline-4">
<h4 id="sec-1.8.4"><span class="section-number-4">1.8.4</span> L</h4>
<div class="outline-text-4" id="text-1.8.4">



<p>
<a name="index==L" id="index==L"></a>
</p><ul>
<li>
<a href="#macro==labels*"><code>labels*</code></a>, Macro
</li>
<li>
<a href="#macro==lambda*"><code>lambda*</code></a>, Macro





</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Colophon</h2>
<div class="outline-text-2" id="text-2">


<p>
This documentation was generated from Common Lisp source code using CLOD, version 1.0.
The latest version of CLOD is available <a href="http://bitbucket.org/eeeickythump/clod/">here</a>.
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Paul Sexton
<a href="mailto:eeeickythump@gmail.com">&lt;eeeickythump@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2010-03-19 16:13:59 </p>
<p class="creator">HTML generated by org-mode 6.34trans in emacs 23</p>
</div>
</div>
</body>
</html>
